# Milestone 2

### Creating Modeled Tables

In [32]:
%%bigquery
CREATE TABLE H_1B_refined.Employer(
    employer_name STRING,
    employer_address STRING,
    employer_city STRING,
    employer_state STRING,
    employer_postal_code STRING,
    employer_country STRING,
    employer_province STRING,
    h_1b_dependent BOOL,
    willful_violator BOOL,
    );

Empty DataFrame
Columns: []
Index: []

In [33]:
%%bigquery
CREATE TABLE H_1B_refined.Application(
CASE_NUMBER STRING,
CASE_STATUS STRING,
CASE_SUBMITTED STRING,
DECESION_DATE STRING,
VISA_CLASS STRING,
employer_name STRING,
employer_city STRING);

Empty DataFrame
Columns: []
Index: []

In [34]:
%%bigquery
CREATE TABLE H_1B_refined.Occupation(
job_title STRING, 
employer_name STRING,
employer_city STRING,
employment_start_date STRING, 
employment_end_date STRING, 
soc_code STRING, 
soc_title STRING,
prevailing_wage_YR FLOAT64,
pw_wage_level STRING,
pw_wage_source STRING,
pw_wage_source_year INT64,
pw_wage_source_other STRING,
worksite_city STRING,
worksite_country STRING,
worksite_state STRING,
worksite_postal_code STRING);

Empty DataFrame
Columns: []
Index: []

In [52]:
%%bigquery
CREATE TABLE H_1B_refined.Ownership(
    occ_code STRING,
    occ_title STRING,
    ownership STRING,
    naics_title STRING,
    grp STRING,
    tot_emp INT64,
    emp_prse FLOAT64,
    h_mean FLOAT64,
    a_mean INT64,
    mean_prse FLOAT64,
    a_pct10 INT64,
    a_pct25 INT64,
    a_median INT64,
    a_pct75 INT64,
    a_pct90 INT64
);

Empty DataFrame
Columns: []
Index: []

### Popolating Data into modeled tables

In [97]:
%%bigquery
INSERT INTO H_1B_refined.Employer (employer_name, employer_address, employer_city, employer_state, employer_postal_code)
SELECT LCA_CASE_EMPLOYER_NAME, LCA_CASE_EMPLOYER_ADDRESS, LCA_CASE_EMPLOYER_CITY, LCA_CASE_EMPLOYER_STATE,LCA_CASE_EMPLOYER_POSTAL_CODE
FROM H_1B_Complete.h1b_2014_2;

Empty DataFrame
Columns: []
Index: []

In [36]:
%%bigquery
INSERT INTO H_1B_refined.Employer (employer_name, employer_address, employer_city, employer_state, employer_postal_code, employer_country, employer_province, h_1b_dependent, willful_violator
)
SELECT EMPLOYER_NAME, EMPLOYER_ADDRESS1, EMPLOYER_CITY, EMPLOYER_STATE, EMPLOYER_POSTAL_CODE, EMPLOYER_COUNTRY, EMPLOYER_PROVINCE, H_1B_DEPENDENT, WILLFUL_VIOLATOR
FROM H_1B_Complete.h1b_2015_4;

Empty DataFrame
Columns: []
Index: []

In [37]:
%%bigquery
INSERT INTO H_1B_refined.Employer (employer_name, employer_address, employer_city, employer_state, employer_postal_code, employer_country, employer_province, h_1b_dependent, willful_violator
)
SELECT EMPLOYER_NAME, EMPLOYER_ADDRESS, EMPLOYER_CITY, EMPLOYER_STATE, EMPLOYER_POSTAL_CODE, EMPLOYER_COUNTRY, EMPLOYER_PROVINCE, H_1B_DEPENDENT, WILLFUL_VIOLATOR
FROM H_1B_Complete.h1b_2016_2;

Empty DataFrame
Columns: []
Index: []

In [38]:
%%bigquery
INSERT INTO H_1B_refined.Employer (employer_name, employer_address, employer_city, employer_state, employer_postal_code, employer_country, employer_province, h_1b_dependent, willful_violator
)
SELECT EMPLOYER_NAME, EMPLOYER_ADDRESS, EMPLOYER_CITY, EMPLOYER_STATE, EMPLOYER_POSTAL_CODE, EMPLOYER_COUNTRY, EMPLOYER_PROVINCE, H1B_DEPENDENT, WILLFUL_VIOLATOR
FROM H_1B_Complete.h1b_2017_2;

Empty DataFrame
Columns: []
Index: []

In [39]:
%%bigquery
INSERT INTO H_1B_refined.Employer (employer_name, employer_address, employer_city, employer_state, employer_postal_code, employer_country, employer_province, h_1b_dependent, willful_violator
)
SELECT EMPLOYER_NAME, EMPLOYER_ADDRESS, EMPLOYER_CITY, EMPLOYER_STATE, EMPLOYER_POSTAL_CODE, EMPLOYER_COUNTRY, EMPLOYER_PROVINCE, H1B_DEPENDENT, WILLFUL_VIOLATOR
FROM H_1B_Complete.h1b_2018_2;

Empty DataFrame
Columns: []
Index: []

In [40]:
%%bigquery
INSERT INTO H_1B_refined.Application (CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECESION_DATE, VISA_CLASS, employer_name, employer_city)
SELECT LCA_CASE_NUMBER, STATUS, LCA_CASE_SUBMIT, DECISION_DATE, VISA_CLASS, LCA_CASE_EMPLOYER_NAME, LCA_CASE_EMPLOYER_CITY
FROM H_1B_Complete.h1b_2014_2;

Empty DataFrame
Columns: []
Index: []

In [42]:
%%bigquery
INSERT INTO H_1B_refined.Application (CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECESION_DATE, VISA_CLASS, employer_name, employer_city)
SELECT CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECISION_DATE, VISA_CLASS, EMPLOYER_NAME, EMPLOYER_CITY
FROM H_1B_Complete.h1b_2015_2;

Empty DataFrame
Columns: []
Index: []

In [43]:
%%bigquery
INSERT INTO H_1B_refined.Application (CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECESION_DATE, VISA_CLASS, employer_name, employer_city)
SELECT CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECISION_DATE, VISA_CLASS, EMPLOYER_NAME, EMPLOYER_CITY
FROM H_1B_Complete.h1b_2016_2;

Empty DataFrame
Columns: []
Index: []

In [44]:
%%bigquery
INSERT INTO H_1B_refined.Application (CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECESION_DATE, VISA_CLASS, employer_name, employer_city)
SELECT CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECISION_DATE, VISA_CLASS, EMPLOYER_NAME, EMPLOYER_CITY
FROM H_1B_Complete.h1b_2017_2;

Empty DataFrame
Columns: []
Index: []

In [45]:
%%bigquery
INSERT INTO H_1B_refined.Application (CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECESION_DATE, VISA_CLASS, employer_name, employer_city)
SELECT CASE_NUMBER, CASE_STATUS, CASE_SUBMITTED, DECISION_DATE, VISA_CLASS, EMPLOYER_NAME, EMPLOYER_CITY
FROM H_1B_Complete.h1b_2018_2;

Empty DataFrame
Columns: []
Index: []

In [46]:
%%bigquery
INSERT INTO H_1B_refined.Occupation (job_title, employer_name, employer_city, employment_start_date, employment_end_date, soc_code, soc_title, prevailing_wage_YR, pw_wage_source, pw_wage_source_year, pw_wage_source_other, worksite_city, worksite_state)
SELECT LCA_CASE_JOB_TITLE, LCA_CASE_EMPLOYER_NAME, LCA_CASE_EMPLOYER_CITY, LCA_CASE_EMPLOYMENT_START_DATE, LCA_CASE_EMPLOYMENT_END_DATE, LCA_CASE_SOC_CODE, LCA_CASE_SOC_NAME, CEILING(PW_1), PW_SOURCE_1, YR_SOURCE_PUB_1, OTHER_WAGE_SOURCE_1, LCA_CASE_WORKLOC1_CITY, LCA_CASE_WORKLOC1_STATE
FROM H_1B_Complete.h1b_2014_2;

Empty DataFrame
Columns: []
Index: []

In [47]:
%%bigquery
INSERT INTO H_1B_refined.Occupation (job_title, employer_name, employer_city, employment_start_date, employment_end_date, soc_code, soc_title, prevailing_wage_YR, pw_wage_level, pw_wage_source, pw_wage_source_year, pw_wage_source_other, worksite_city, worksite_country, worksite_state, worksite_postal_code)
SELECT JOB_TITLE, EMPLOYER_NAME, EMPLOYER_CITY, EMPLOYMENT_START_DATE, EMPLOYMENT_END_DATE, SOC_CODE, SOC_NAME, PREVAILING_WAGE_YR, PW_WAGE_LEVEL, PW_WAGE_SOURCE, PW_WAGE_SOURCE_YEAR, PW_WAGE_SOURCE_OTHER, WORKSITE_CITY, WORKSITE_COUNTY, WORKSITE_STATE, WORKSITE_POSTAL_CODE
FROM H_1B_Complete.h1b_2015_3;

Empty DataFrame
Columns: []
Index: []

In [48]:
%%bigquery
INSERT INTO H_1B_refined.Occupation (job_title, employer_name, employer_city, employment_start_date, employment_end_date, soc_code, soc_title, prevailing_wage_YR, pw_wage_source, pw_wage_source_year, pw_wage_source_other, worksite_city, worksite_country, worksite_state, worksite_postal_code)
SELECT JOB_TITLE, EMPLOYER_NAME, EMPLOYER_CITY, EMPLOYMENT_START_DATE, EMPLOYMENT_END_DATE, SOC_CODE, SOC_NAME, PREVAILING_WAGE, PW_WAGE_SOURCE, PW_SOURCE_YEAR, PW_SOURCE_OTHER, WORKSITE_CITY, WORKSITE_COUNTY, WORKSITE_STATE, WORKSITE_POSTAL_CODE
FROM H_1B_Complete.h1b_2016_2;

Empty DataFrame
Columns: []
Index: []

In [49]:
%%bigquery
INSERT INTO H_1B_refined.Occupation (job_title, employer_name, employer_city, employment_start_date, employment_end_date, soc_code, soc_title, prevailing_wage_YR, pw_wage_level, pw_wage_source, pw_wage_source_year, pw_wage_source_other, worksite_city, worksite_country, worksite_state, worksite_postal_code)
SELECT JOB_TITLE, EMPLOYER_NAME, EMPLOYER_CITY, EMPLOYMENT_START_DATE, EMPLOYMENT_END_DATE, SOC_CODE, SOC_NAME, PREVAILING_WAGE, PW_WAGE_LEVEL, PW_SOURCE, PW_SOURCE_YEAR, PW_SOURCE_OTHER, WORKSITE_CITY, WORKSITE_COUNTY, WORKSITE_STATE, WORKSITE_POSTAL_CODE
FROM H_1B_Complete.h1b_2017_2;

Empty DataFrame
Columns: []
Index: []

In [50]:
%%bigquery
INSERT INTO H_1B_refined.Occupation (job_title, employer_name, employer_city, employment_start_date, employment_end_date, soc_code, soc_title, prevailing_wage_YR, pw_wage_level, pw_wage_source, pw_wage_source_year, pw_wage_source_other, worksite_city, worksite_country, worksite_state, worksite_postal_code)
SELECT JOB_TITLE, EMPLOYER_NAME, EMPLOYER_CITY, EMPLOYMENT_START_DATE, EMPLOYMENT_END_DATE, SOC_CODE, SOC_NAME, PREVAILING_WAGE, PW_WAGE_LEVEL, PW_SOURCE, PW_SOURCE_YEAR, PW_SOURCE_OTHER, WORKSITE_CITY, WORKSITE_COUNTY, WORKSITE_STATE, WORKSITE_POSTAL_CODE
FROM H_1B_Complete.h1b_2018_2;

Empty DataFrame
Columns: []
Index: []

In [53]:
%%bigquery
INSERT INTO H_1B_refined.Ownership
SELECT nat.occ_code, nat.occ_title, own.ownership, sec.naics_title, nat.group, nat.tot_emp, nat.emp_prse, nat.h_mean, nat.a_mean, nat.mean_prse, nat.a_pct10, nat.a_pct25, nat.a_median, nat.a_pct75, nat.a_pct90
FROM oesm_staging.OESM_national_14 as nat
JOIN
oesm_staging.OESM_owner_14 as own ON nat.occ_code = own.occ_code
JOIN
oesm_staging.OESM_sector_14 as sec ON own.occ_code = sec.occ_code

Empty DataFrame
Columns: []
Index: []

In [54]:
%%bigquery
INSERT INTO H_1B_refined.Ownership
SELECT nat.occ_code, nat.occ_title, own.ownership, sec.naics_title, nat.group, nat.tot_emp, nat.emp_prse, nat.h_mean, nat.a_mean, nat.mean_prse, nat.a_pct10, nat.a_pct25, nat.a_median, nat.a_pct75, nat.a_pct90
FROM oesm_staging.OESM_national_15 as nat
JOIN
oesm_staging.OESM_owner_15 as own ON nat.occ_code = own.occ_code
JOIN
oesm_staging.OESM_sector_15 as sec ON own.occ_code = sec.occ_code

Empty DataFrame
Columns: []
Index: []

In [55]:
%%bigquery
INSERT INTO H_1B_refined.Ownership
SELECT nat.occ_code, nat.occ_title, own.ownership, sec.naics_title, nat.group, nat.tot_emp, nat.emp_prse, nat.h_mean, nat.a_mean, nat.mean_prse, nat.a_pct10, nat.a_pct25, nat.a_median, nat.a_pct75, nat.a_pct90
FROM oesm_staging.OESM_national_16 as nat
JOIN
oesm_staging.OESM_owner_16 as own ON nat.occ_code = own.occ_code
JOIN
oesm_staging.OESM_sector_16 as sec ON own.occ_code = sec.occ_code

Empty DataFrame
Columns: []
Index: []

In [56]:
%%bigquery
INSERT INTO H_1B_refined.Ownership
SELECT nat.occ_code, nat.occ_title, own.ownership, sec.naics_title, nat.group, nat.tot_emp, nat.emp_prse, nat.h_mean, nat.a_mean, nat.mean_prse, nat.a_pct10, nat.a_pct25, nat.a_median, nat.a_pct75, nat.a_pct90
FROM oesm_staging.OESM_national_17 as nat
JOIN
oesm_staging.OESM_owner_17 as own ON nat.occ_code = own.occ_code
JOIN
oesm_staging.OESM_sector_17 as sec ON own.occ_code = sec.occ_code

Empty DataFrame
Columns: []
Index: []

In [57]:
%%bigquery
INSERT INTO H_1B_refined.Ownership
SELECT nat.occ_code, nat.occ_title, own.ownership, sec.naics_title, nat.group, nat.tot_emp, nat.emp_prse, nat.h_mean, nat.a_mean, nat.mean_prse, nat.a_pct10, nat.a_pct25, nat.a_median, nat.a_pct75, nat.a_pct90
FROM oesm_staging.OESM_national_18 as nat
JOIN
oesm_staging.OESM_owner_18 as own ON nat.occ_code = own.occ_code
JOIN
oesm_staging.OESM_sector_18 as sec ON own.occ_code = sec.occ_code

Empty DataFrame
Columns: []
Index: []

### Check primary key constraint on Occupation

In [1]:
%%bigquery
select count(*) total_count
from H_1B_refined.Occupation

   total_count
0      7169310

In [2]:
%%bigquery
select count(*) distinct_event_count
from
(select distinct f0_
from H_1B_refined.Occupation)

   distinct_event_count
0               2561872

### Choose a primitive data type

##### Converting YYYY.MM.DD format to YYYY-MM-DD format in Occupation table
#### ************We manually changed the most data type when we insert the data. The main data that needs casting is employment_start_date and employment_end_date, which I discussed with the professor and decided to convert it to DATE type using BEAM in the next milestone. Despite this fact, we tried to chage the values with yyyy.mm.dd format and yyyy/mm/dd format into yyyy-mm-dd format. The one that preventing us from casting this STRING data to DATE data is the values whose format is mm.dd.yyyy.

In [9]:
%%bigquery
UPDATE H_1B_refined.Occupation 
SET employment_start_date = REPLACE(employment_start_date, ".", "-")
WHERE employment_start_date is not NULL;

Empty DataFrame
Columns: []
Index: []

In [16]:
%%bigquery
UPDATE H_1B_refined.Occupation 
SET employment_start_date = REPLACE(employment_start_date, "/", "-")
WHERE employment_start_date is not NULL;

Empty DataFrame
Columns: []
Index: []

In [10]:
%%bigquery
UPDATE H_1B_refined.Occupation 
SET employment_end_date = REPLACE(employment_end_date, ".", "-")
WHERE employment_end_date is not NULL;

Empty DataFrame
Columns: []
Index: []

In [17]:
%%bigquery
UPDATE H_1B_refined.Occupation 
SET employment_end_date = REPLACE(employment_end_date, "/", "-")
WHERE employment_end_date is not NULL;

Empty DataFrame
Columns: []
Index: []

### Here, we were able to change yyyy.mm.dd STRING format to yyyy-mm-dd format so that we can CAST its type to DATE. (CASE_SUBMITTED and DECESION_DATE)

In [79]:
%%bigquery
UPDATE H_1B_refined.Application 
SET CASE_SUBMITTED = REPLACE(CASE_SUBMITTED, ".", "-")
WHERE CASE_SUBMITTED is not NULL;

Empty DataFrame
Columns: []
Index: []

In [80]:
%%bigquery
UPDATE H_1B_refined.Application 
SET DECESION_DATE = REPLACE(DECESION_DATE, ".", "-")
WHERE DECESION_DATE is not NULL;

Empty DataFrame
Columns: []
Index: []

In [82]:
%%bigquery
create or replace table H_1B_refined.Application as
select CASE_NUMBER, CASE_STATUS, CAST(CASE_SUBMITTED AS DATE) as CASE_SUBMITTED, CAST(DECESION_DATE AS DATE) as DECESION_DATE, VISA_CLASS, employer_name, employer_city
from H_1B_refined.Application
where DECESION_DATE is not NULL AND CASE_SUBMITTED is not NULL

Empty DataFrame
Columns: []
Index: []

## Explore data

#### 1. Find job titles that have yearly prevailing wage higher than average of yearly prevailing wage where yearly prevailing wage is greater than 100000. Drop duplicates in job title and desc order by prevailing_wage_YR, and limit the output by 20.

In [132]:
%%bigquery
SELECT DISTINCT job_title, prevailing_wage_YR
FROM H_1B_refined.Occupation as occ
WHERE occ.prevailing_wage_YR > (
                    SELECT avg(prevailing_wage_YR)
                    FROM H_1B_refined.Occupation
                    WHERE prevailing_wage_YR > 100000
                    )
ORDER BY prevailing_wage_YR DESC
LIMIT 20;

                              job_title  prevailing_wage_YR
0                  U.S. LEGAL ASSISTANT        1.000000e+09
1                       PROJECT MANAGER        8.201323e+08
2                    PROGRAMMER/ANALYST        6.169317e+08
3                    RESEARCH ASSOCIATE        4.134726e+08
4                    CONSULTANT LEVEL 3        2.016227e+08
5                     MARKETING MANAGER        1.375920e+07
6   CLINICAL DIRECTOR OF ADULT MEDICINE        1.029390e+07
7                     SOFTWARE ENGINEER        9.110400e+06
8               MARKET RESEARCH ANALYST        8.958600e+06
9                   MANAGING CONSULTANT        8.937800e+06
10                          ARCHITECT 3        8.927499e+06
11                PRINCIPLE RF ENGINEER        8.927400e+06
12                          RF ENGINEER        8.927400e+06
13                     IT AUDIT MANAGER        8.738100e+06
14                     DEV/OPS ENGINEER        8.490600e+06
15                   SOFTWARE DEVELOPER        7.049100e+06
16          RESEARCH SCIENTIST/ENGINEER        6.468800e+06
17                    SOFTWARE ENGINEER        6.217100e+06
18             COMPUTER SYSTEMS ANALYST        6.169300e+06
19                   PROGRAMMER ANALYST        6.077800e+06

#### 2. Find occupational title, employer's name and average total employment which is greater than 100000 and the employers are not willful_violator. Then sort by the average of total employment. Which employer and its occupational title have highest avg total employment?

In [134]:
%%bigquery
SELECT own.occ_title, emp.employer_name, AVG(own.tot_emp) as avg_total_employment
FROM H_1B_refined.Ownership as own
JOIN 
H_1B_refined.Occupation as occ ON own.occ_code = occ.soc_code
JOIN
H_1B_refined.Employer as emp ON occ.employer_name = emp.employer_name AND occ.employer_city = emp.employer_name
WHERE own.tot_emp > 100000 AND emp.willful_violator = False
GROUP BY own.occ_title, emp.employer_name
ORDER BY avg_total_employment DESC
LIMIT 20;

,occ_title,employer_name,avg_total_employment
0,General and Operations Managers,GVHB,2.177170e+06
1,Accountants and Auditors,1,1.232338e+06
2,"Software Developers, Applications",ELWYN,8.041223e+05
3,Coaches and Scouts,MILLIGAN COLLEGE,2.269707e+05
4,Coaches and Scouts,NIAGARA UNIVERSITY,2.269707e+05
5,"Health Specialties Teachers, Postsecondary",LINCOLN UNIVERSITY,1.868121e+05
6,Mental Health Counselors,ELWYN,1.297491e+05
7,Occupational Therapists,ELWYN,1.192115e+05
8,Database Administrators,ELWYN,1.126900e+05
9,"Clinical, Counseling, and School Psychologists",ELWYN,1.073720e+05

#### 3. Find employers who are h-1b dependent employer and whose city is in AUSTIN. The employers are those who are not included in willful violator list. Order the result by descending order and limit the ouput by 20.

In [54]:
%%bigquery
SELECT DISTINCT employer_name, employer_city, h_1b_dependent
FROM H_1B_refined.Employer
WHERE h_1b_dependent = True AND employer_city="AUSTIN" AND employer_name NOT IN (
                    SELECT employer_name
                    FROM H_1B_refined.Employer
                    WHERE willful_violator=True)
ORDER BY employer_name DESC
LIMIT 20;

               employer_name employer_city  h_1b_dependent
0         YANA SOFTWARE INC.        AUSTIN            True
1          YANA SOFTWARE INC        AUSTIN            True
2   VSION TECHNOLOGIES, INC.        AUSTIN            True
3       VRN TECHNOLOGIES LLC        AUSTIN            True
4         TTS SOLUTIONS,INC.        AUSTIN            True
5          TTS SOLUTIONS,INC        AUSTIN            True
6         TTS SOLUTIONS INC.        AUSTIN            True
7      TERRA TECHNOLOGY, LLC        AUSTIN            True
8        TECRA SYSTEMS, INC.        AUSTIN            True
9             TECHNOZANT LLC        AUSTIN            True
10   TAPROOT SOLUTIONS, INC.        AUSTIN            True
11       TAKE SOLUTIONS INC.        AUSTIN            True
12       STECK SYSTEMS, INC.        AUSTIN            True
13      SOFTWARE GLOBAL LTD.        AUSTIN            True
14           SICONTECH, INC.        AUSTIN            True
15        SHAKTI GROUP, INC.        AUSTIN            True
16           REDDWERKS CORP.        AUSTIN            True
17        M9 CONSULTING INC.        AUSTIN            True
18         LOM NETWORKS INC.        AUSTIN            True
19             IRUNWAY, INC.        AUSTIN            True

#### 4. Find ownership, occupation title, and the count of the occupation titles where total emploment is greater than 1000000 and its group is not minor. Also, filter out those occupational titles whose annual wage mean is greater than its annual prevailing wage. Order the result by thecount of the occupation titles and limit the result by 20.

In [76]:
%%bigquery
SELECT own.ownership, own.occ_title, COUNT(own.occ_title) as occ_title_count
FROM H_1B_refined.Ownership as own
JOIN H_1B_refined.Occupation as occ ON own.occ_code = occ.soc_code
WHERE own.tot_emp > 1000000 AND own.grp != "minor" AND own.a_mean > occ.prevailing_wage_YR
GROUP BY own.ownership, own.occ_title
ORDER BY occ_title_count DESC
LIMIT 20;

,ownership,occ_title,occ_title_count
0,State government,Accountants and Auditors,5357340
1,Private,Accountants and Auditors,5357340
2,Federal government,Accountants and Auditors,5357340
3,Local government,Accountants and Auditors,5357340
4,"Federal, State, and Local government",Accountants and Auditors,5357340
5,Federal government,General and Operations Managers,767140
6,Private,General and Operations Managers,767140
7,Local government,General and Operations Managers,767140
8,State government,General and Operations Managers,767140
9,"Federal, State, and Local government",General and Operations Managers,767140
10,Local government,"Business Operations Specialists, All Other",236060
11,Private,"Business Operations Specialists, All Other",236060
12,State government,"Business Operations Specialists, All Other",236060
13,Federal government,"Business Operations Specialists, All Other",236060
14,"Federal, State, and Local government","Business Operations Specialists, All Other",236060
15,State government,"Elementary School Teachers, Except Special Edu...",196975
16,"Federal, State, and Local government","Elementary School Teachers, Except Special Edu...",196975
17,Private,"Elementary School Teachers, Except Special Edu...",196975
18,Local government,"Elementary School Teachers, Except Special Edu...",196975
19,Federal government,Registered Nurses,111407

#### 5. Find ownerships whose sum of mean of annual wage is smaller than the sum of annual prevailing wage. Order by sum of annual wage mean in descending order and limit the output by 20.

In [90]:
%%bigquery
SELECT own.ownership, SUM(own.a_mean) as sum_of_annual_wage_mean
FROM H_1B_refined.Ownership as own
GROUP BY own.ownership
HAVING sum_of_annual_wage_mean < (
                    SELECT SUM(prevailing_wage_YR)
                    FROM H_1B_refined.Occupation as occ
                    )
ORDER BY sum_of_annual_wage_mean DESC
LIMIT 20;

                              ownership  sum_of_annual_wage_mean
0                               Private               4593113240
1  Federal, State, and Local government               4429273080
2                      Local government               4213928470
3                      State government               4115976430
4                    Federal government               3226144580

## Create Views for number 2 and 3 from above

In [135]:
%%bigquery
CREATE VIEW insights.v_Highet_Avg_Tot_Emp as 
SELECT own.occ_title, emp.employer_name, AVG(own.tot_emp) as avg_total_employment
FROM H_1B_refined.Ownership as own
JOIN 
H_1B_refined.Occupation as occ ON own.occ_code = occ.soc_code
JOIN
H_1B_refined.Employer as emp ON occ.employer_name = emp.employer_name AND occ.employer_city = emp.employer_name
WHERE own.tot_emp > 100000 AND emp.willful_violator = False
GROUP BY own.occ_title, emp.employer_name
ORDER BY avg_total_employment DESC

Empty DataFrame
Columns: []
Index: []

In [31]:
%%bigquery
CREATE VIEW insights.v_More_Emp_Occ as 
SELECT own.ownership, own.occ_title, COUNT(own.occ_title) as occ_title_count
FROM H_1B_refined.Ownership as own
JOIN H_1B_refined.Occupation as occ ON own.occ_code = occ.soc_code
WHERE own.tot_emp > 1000000 AND own.grp != "minor" AND own.a_mean > occ.prevailing_wage_YR
GROUP BY own.ownership, own.occ_title
ORDER BY occ_title_count DESC

Empty DataFrame
Columns: []
Index: []

## ERD

### For ERD, we put our PK and FK candidates because in current stage, we do not have employer_id nor job_id. Because of this issue, even though we could have manually create PKs before we create modeled tables, we decided to use employer_name and employer_city (because there could be the same employer name in different location) as our temporary "PK"s so that we could perform JOIN function and connect the modeled tables in this stage.

### But since the rubric says the PKs and FKs have to be supported by code, we included another ERD that kinda represents our code. (We know that we are putting PK on the element that has duplicates (job_title from Occupation table). We made this ERD just for the reference sake for us but thought this could give the representation of our code except the PK on job_title.